HMI V1.06/Assembly/SampleXML/getProcessLotDetails.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:r4="http://systemagmbh.com/manufacturing-automation/r4/">
   <soapenv:Header/>
   <soapenv:Body>
      <r4:getProcessLotDetails>
         <getProcessLotDetailsRequest>
            <resourceId></resourceId>
            <processLot></processLot>
         </getProcessLotDetailsRequest>
      </r4:getProcessLotDetails>
   </soapenv:Body>
</soapenv:Envelope>